[Notebook](https://github.com/jmportilla/SQL-Appendix/blob/master/Introduction%20to%20SQL%20with%20Python.ipynb)

In [1]:
# Imports
import sqlite3
import pandas as pd

In [2]:
# create connection with DB
con = sqlite3.connect('sakila.db')

In [4]:
# Create query
sql_query = '''SELECT * FROM customer'''

# Perform query with pandas and add results into a DataFrame
df = pd.read_sql(sql_query, con)

# Results
df.head()

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36.000,2011-09-14 18:10:28
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36.000,2011-09-14 18:10:28
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36.000,2011-09-14 18:10:28
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1,2006-02-14 22:04:36.000,2011-09-14 18:10:28
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36.000,2011-09-14 18:10:28